Revit 2027 API
AnalyticalNodeConnectionStatus Enumeration
 Indicates the Connections Status for an Analytical Node.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalNodeConnectionStatus
Public Enumeration AnalyticalNodeConnectionStatus
public enum class AnalyticalNodeConnectionStatus
type AnalyticalNodeConnectionStatus
Members
Member name | Value | Description
Connected | 1 |  Connected
Unconnected | 0 |  Unconnected node (only one connected element)
See Also
Reference
Autodesk.Revit.DB.Structure Namespace